{
  "extracted_at": "2025-09-12T11:13:35.383872",
  "source": "Coimbatore Junction - Ward List",
  "source_url": "https://coimbatorejunction.in/coimbatore-ward-list/",
  "total_wards": 97,
  "data": {
    "wards": [
      {
        "ward_number": "1",
        "ward_name": "Ward 1",
        "directions": {
          "north": [
            "Starts from S.F. No. 204 Of Thudiyalur Village, Udayakumar Thottam towards North East Johnbosco Nagar, Saravana Nagar, crossing Eashwar Sakthi Nagar, Palanigoundenpudur Road, S.F. No. 206 Soundararajan Thottam via Mullai Nagar, Suruthi Avenue, Eashwara Nagar Boundary via towards South Chettiar Thottam, Sowdambika Nagar Pallam via Mettupalayam Road Junction, then towards South Vellakinar Road via, towards East including Ambika Nagar ,manis Nagar, Anna Colony Entrance, Thudiyalur Ward Office, Vellakinar Road Southern Side via upto Thudiyalur Railway Gate."
          ],
          "east": [
            "Starts from Vellakinar Road Thudiyalur Railway Gate towards South, V.P.V. Nagar, Viswanathapuram Boundary upto Chinnavedampatti Canal, towards West abutting Canal upto Mettupalayam Road Junction, In Mettupalayam Road West Side towards South uptoV.K.L. Nagar Road."
          ]
        }
      },
      {
        "ward_number": "2",
        "ward_name": "Ward 2",
        "directions": {
          "north": [
            "Starts from Mettupalayam Road Thudiyalur Police Station. Northern Side, SS Kalyana Mandapam Road via, towards East Thudiyalaur Modem Crematorium, towards North Crossing ldikarai Road, TNP Nagar Northern Boundary via, towards East New Muthu Nagar Boundary, Coimbatore Mtp Railway Track, Crossing Northern Boundary, towards East TNHB Phase 11, Phase Ill via Kurudampalayam ldikarai Junction. towards East Vattamalaipalayall’) Ganga Nursing College, Ramakrishna College Road, upto Chinnarayan Temple."
          ],
          "east": [
            "Starts from Northern Boundary Ramakrishna College Backside Road via upto Panchayat Union School (including School), towards South then towards East Coimbatore Public School Road via then towards South upto Thudiyalur Saravanampatti Road Junction."
          ],
          "south": [
            "Starts from Thudiyalur Saravanampatti R and Coimbatore Public School Road Junction, towards West Donbosco Puram via including Martin Nandavanam Apartment. Assisi Nagar via towards South including Brilliant School, Peria Thottam. there onwards West upto Vellakinar N.G. Pudur Road Junction."
          ]
        }
      },
      {
        "ward_number": "3",
        "ward_name": "Ward 3",
        "directions": {
          "north": [
            "Starts from Thudiyalur Saravanampatti R and Coimbatore Public School Road Junction, towards West Donbosco Puram via including Martin Nandavanam Apartment. Assisi Nagar via towards South including Brilliant School, Peria Thottam. there onwards West upto Vellakinar N.G. Pudur Road Junction."
          ],
          "east": [
            "Starts from S.F.No. 454 Northeast Boundary, towards South upto S.F. No. 454, 455’s Southeast Village Boundary, there onwardsWest Saravanampatti Village Boundary via",
            "S.F. No. 456 Southeast Boundary, there onwardsSouth Saravanampatti Village Boundary via upto S.F. No. 463 Southeast Boundary, there onwardsWest Saravanmnpatti Village Boundary via S.F. No. 466 Southeast Boundary, there onwards South Sarvanampatti Village Boundary via upto Velappanayakanpudur. there onwards East Village Boundary via S.F. No. 632 Northeast Boundary, there onwardsEast Village Border via S.F. No. 637 Northeast Boundary, there onwards Village Boundary Saravanmpatti onwards Thudiyalur Road, Kumaraguru College Of Technology including, S.F. No. 593 Northeast Boundary onwardsSouth Village Boundary, there onwardsWest S.F. No. 596 Southeast, towards South Tangedco Office, there onwards including Teachers Colony. KurinJi Nagar, there onwards S.F. No. 614 Southeast Area, there onwardsSouth Village Boundary via Sakthi Nagar Southeast Boundary, towards South upto Ramakrishna Mill Northern Boundary, there onwardsWest Athipalayam Main Road Maniyakaranpalayam Road Junction."
          ],
          "south": [
            "Starts from S.F.No. 454 Northeast Boundary, towards South upto S.F. No. 454, 455’s Southeast Village Boundary, there onwardsWest Saravanampatti Village Boundary viaS.F. No. 456 Southeast Boundary, there onwardsSouth Saravanampatti Village Boundary via upto S.F. No. 463 Southeast Boundary, there onwardsWest Saravanmnpatti Village Boundary via S.F. No. 466 Southeast Boundary, there onwards South Sarvanampatti Village Boundary via upto Velappanayakanpudur. there onwards East Village Boundary via S.F. No. 632 Northeast Boundary, there onwardsEast Village Border via S.F. No. 637 Northeast Boundary, there onwards Village Boundary Saravanmpatti onwards Thudiyalur Road, Kumaraguru College Of Technology including, S.F. No. 593 Northeast Boundary onwardsSouth Village Boundary, there onwardsWest S.F. No. 596 Southeast, towards South Tangedco Office, there onwards including Teachers Colony. KurinJi Nagar, there onwards S.F. No. 614 Southeast Area, there onwardsSouth Village Boundary via Sakthi Nagar Southeast Boundary, towards South upto Ramakrishna Mill Northern Boundary, there onwardsWest Athipalayam Main Road Maniyakaranpalayam Road Junction."
          ]
        }
      },
      {
        "ward_number": "4",
        "ward_name": "Ward 4",
        "directions": {
          "north": [
            "Starts from Thudiyalur Road 2 Kms awayiln Keeranatham Road lead to Special Economic Zone and Sathy Road Keeranatham Road,including VKV Kumaraguru Nagar, Corporation Elementary School, Kandasami Nagar upto Sathy Road."
          ],
          "east": [
            "Starts from Sathy Road towards South, Viswasapuram Antony’s Church via including Revenue Nagar, Siva Elango Nagar, Maha Nagar, upto K.G. Lay Out"
          ],
          "south": [
            "Starts from K.G. Lay Out towards West. including Jaya Nagar upto Jaya Nagar Western Boundary, there onwardsNorth, Boyar Street Eastern Boundary via Sathy Road Upa Sandhu Southern Boundary via towards West upto Sathy Road, there onwardsSouth, upto Saravanampatti Check Post, towards West, including Sri Ram Nagar, Ramanandha Nagar Northern Boundary via upto Southnorth Canal. there onwardsSri Nagar Southern Boundary via iin<;luding Meenatchi Nagar, towards West Chinnavedampatti Village Boundary."
          ],
          "west": [
            "Starts from K.G. Lay Out towards West. including Jaya Nagar upto Jaya Nagar Western Boundary, there onwardsNorth, Boyar Street Eastern Boundary via Sathy Road Upa Sandhu Southern Boundary via towards West upto Sathy Road, there onwardsSouth, upto Saravanampatti Check Post, towards West, including Sri Ram Nagar, Ramanandha Nagar Northern Boundary via upto Southnorth Canal. there onwardsSri Nagar Southern Boundary via iin<;luding Meenatchi Nagar, towards West Chinnavedampatti Village Boundary."
          ]
        }
      },
      {
        "ward_number": "5",
        "ward_name": "Ward 5",
        "directions": {
          "north": [
            "Starts from from Ragavi Garden towards East VKV Nagar along Sathy Main Road via Valiyampalayam upto Kurumbapalayam Channel"
          ],
          "east": [
            "Starts from from Kurumbapalayam Channel towards south crossing Thangamman Kovil Road upto Kalapatti Road and Sentholtam Junction"
          ],
          "south": [
            "Starts from from Kalapatti Road and Senthottam Junction towards west via 80 feet Scheme Road upto Vilankurichi Road towards South upto Saravanampatti Road Vilankurichi Road Junction then towards west upto Naga sai Temple Road then towards south upto Thatchan thottom to west upto Lakshimi garden"
          ],
          "west": [
            "Starts from from Lakshmi Garden Saravanampatti Road towards North via Visuvasapuram Road Crossing Sathy Road upto Ragavi Garden."
          ]
        }
      },
      {
        "ward_number": "6",
        "ward_name": "Ward 6",
        "directions": {
          "north": [
            "Starts from from Kalapatti Road Kurumbapalayam Road Junction towards East via Kurumbapalayam Pallam upto Ashok Nagar, Kaikolapalayam Junction"
          ],
          "east": [
            "Starts from from Ashok Nagar, Kaikolapalayam Junction towards south via Muthamil Nagar, Karupparaxanpalayam upto Thottipalayam Temple"
          ],
          "south": [
            "Starts from from Thottipalayam Temple towards west via Rajiv Gandhi Nagar, Elango Nagar upto Nehru Nagar kuttai towards west upto Kalapatti Road junction."
          ],
          "west": [
            "Starts from from Nehru nagar kuttai kalapatti Road Junction towards North via Eastern side of Naren Garden. Eastern side of JJ Nagar Crossing Kalapatti 4 Road Junction towards north upto Kurumbapalayam channel."
          ]
        }
      },
      {
        "ward_number": "7",
        "ward_name": "Ward 7",
        "directions": {
          "north": [
            "Starts from from Nehrunagar East towards east via Southen side of Nehru nagar kuttai towards North upto Elango nagar Junction via stalin veethi via Thottipalayam temple upto GKD Nagar."
          ],
          "east": [
            "Starts from from Lakshmi Nagar towards south via Chinniampalayam Boundary upto RG Pudur"
          ],
          "south": [
            "Starts from from RG Pudur towards West via Avinashi Road upto SITRA Junction"
          ],
          "west": [
            "Starts from from SITRA Junction towards North via Kalapatti Road upto Nehru Nagar East Junction."
          ]
        }
      },
      {
        "ward_number": "8",
        "ward_name": "Ward 8",
        "directions": {
          "north": [
            "Starts from from Kalapatti Road and Senthottam Junction towards East via Thangamman Kovil Road upto Kalapatti R"
          ],
          "east": [
            "Starts from Pfrom Thangamman Kovil Road upto Kalapatti Road Junction towards south Crossing Kalapatti Road, Vilankurichi Road Junction towards South via Kalapatti Road upto Ranga Triyam Bhava"
          ],
          "south": [
            "Starts from from Ranga Triyam Bhava Kalapatti Road towards west via Vilankurichi Road upto Sasi Avenue"
          ],
          "west": [
            "Starts from from Sasi Avenue towards North via Vilankurichi Road, Am Hagar Road then towardi; East then towardN-Jorth via Era Mohan Nagar upto Kalapad Road and Senthottam"
          ]
        }
      },
      {
        "ward_number": "9",
        "ward_name": "Ward 9",
        "directions": {
          "north": [
            "Starts from from Thatachan thottam towards East via Saravanampatti Road upto NR Kalyanamandapam then towards north upto Vilankurichi Road then towards East via 80 feet Scheme Road upto Senthottam Boundry"
          ],
          "east": [
            "Starts from from Senthottam Boundry towards south via Ambethkar Nagar road upto Bankers Colony"
          ],
          "south": [
            "Starts from from Bankers Colony towards west via Vilankurichi Road then towards North upto Southern side of RJ School Bridge then towards southwest via Vinayagapuram Road upto Annai Velankanni Nagar"
          ],
          "west": [
            "Starts from from Annai Velankanni Nagar towards Northeast via Vinayagapuram upto Lakshmi Garden."
          ]
        }
      },
      {
        "ward_number": "10",
        "ward_name": "Ward 10",
        "directions": {
          "north": [
            "Starts from Chinnavedampatti Village Boundary Road, towards East Sri Nagar Southern Boundary via upto Southnorth Canal, towards North including Sps Nagar and Ramanandha Nagar, Ramanandha Nagar Northern Boundary via towards East, Sri Ram Nagar South Boundary via upto Sathy Road saravanampatti Check Post, there onwardsNorth, Sathy Road Upa Sandhu via towards East including Boyar Street, Hospital Street upto Jaya Nagar Southern Boundary via towards East upto K.G. Layout Southern Boundary"
          ],
          "east": [
            "Starts fro Kg Lay Out, towards South Crossing Kalapatti Road towards East Alagu Nagar via Govern,;nent Quarters Backside upto Amman Nagar Boundary towards South upto Vinayakapuram 8th Street."
          ],
          "south": [
            "Starts from Vinayakapuram 8th Street, towards West Sri Vetri Vinayakar Nagar via Sathy Road, there onwardsNorth Chinnavedampatti Road via towards West upto Om Siva Sakthi Nagar."
          ],
          "west": [
            "Starts from Chinnavedampatti Road Sathy Road Junction, Om Siva Sakthi Nagar onwardsNorth Amman Nagar via Crossing Canal, Bose Garden, there onwardsWest including Sri Sakthi Avenue, towards North including Meenatchi Nagar. Anna Nagar, towards East Scheme Road, there onwardsNorth Scheme Road via upto Vivekam School Southern Side Boundary."
          ]
        }
      },
      {
        "ward_number": "11",
        "ward_name": "Ward 11",
        "directions": {
          "north": [
            "Starts from Gowmara Madalayam towards South Abutting Canal Excluding Amman Nagar, Om Sivasakthi Nagar towards East Chinnavedampatti Road via upto Sathy Road Junction."
          ],
          "east": [
            "Starts from Chinnavedampatti Roadsathy Road Junction, towards South Along Sathy Road, Crossing Gowmara Madalayam Entrance Arch upto Sivananthapuram 2nd Street."
          ],
          "south": [
            "Starts from Sivanandapuram 2nd Street towards West upto Sarathi Store, upto Sakthi Nagar Eastern Part."
          ],
          "west": [
            "Starts from Sakthi Nagar East Part, towards North Anandha Nagar, Velmurugan Nagar via Crossing Chinnavedampatti Road, Sri Sundarasamy Road via Janatha Nagar West, Nethaji Nagar Western Boundary via upto Gowmara Madalayam."
          ]
        }
      },
      {
        "ward_number": "12",
        "ward_name": "Ward 12",
        "directions": {
          "north": [
            "Starts from Chinnavedampatti Pond Northwest Boundary, towards Eas: 3- , 2′.sc Global Village via upto Athipalayam Road."
          ],
          "east": [
            "Starts from Srivatsa Global Village Road Athipalayam Main Road Junction, ‘.”.’es:ern Side, towards South Chinnavedampatti Division Office via upto Maniakar3 :2 e,,er Road Athipalayam Road Junction."
          ],
          "south": [
            "Starts from Maniyakaranpalayam Road A hipalayam Road Junc,1or :r ;,a ::isVvest Kakkanji Street, Elango Street, Bharathi Street via upto Maniakaranpalayar· =:_., S::c"
          ],
          "west": [
            "Starts from Maniyakaranpalayam Bus Stop tOWdrds North Udayar Road. including Corporation Middle School, Crossing Mariamman Temple. La-..s:r- Nagar, Western Boundary via towards North Sindhu Nagar Road via upto Anjiga, 39ar Over Head Tank, there onwardsEast Anjugam Nagar Main Roadr upto Chinnavedampatti Pond Northwest Boundary."
          ]
        }
      },
      {
        "ward_number": "13",
        "ward_name": "Ward 13",
        "directions": {
          "north": [
            "Starts from Mtp Road Gn Mills Junction, towards East Crossing Ra … : . :..,ne, via Urumandampalayam Ponds Northern Boundary, including Thiru Vee ·"
          ],
          "east": [
            "Starts from Sindhu Nagar Southeast Boundary, towards South, Laks,-,,,,. · ;2, i?r Western Boundary via Crossing Udayampalayam Mariamman Kovil, towa,c:s s.:_: Crossing Subbanayakenpudur upto Chinnavedampatti Village Boundary."
          ],
          "south": [
            "Starts from Chinnavedampatti Village Boundary, towards West incluc1ng Anbu Nagar, Vijaya Nagar, Balaji Nagar, Manickavasagar Nagar, then towards Nor.r •: a- ,:;kavasagar Nagar Main Road, towards West Amirtha School’s Northern Boundary • a :c .•,arcs West, including Adhirshta Lakshmi Garden, Then Crossing Mettupalayam Rea:. … to Sakthi Nagar Boundary,"
          ],
          "west": [
            "Starts from Mettupalayam Road including Sakthi Nagar, towards EEs: Sm;thside Boundary Of Government Womens lti Junction, towards North upto G.N. -.t ·s – c:ion."
          ]
        }
      },
      {
        "ward_number": "14",
        "ward_name": "Ward 14",
        "directions": {
          "north": [
            "Starts from Mettupalayam Roadchinnavedampatti Canal Abutting, to-.\\ar-::; ::es: Railway Track there onwards, towards North V.PV Nagar Boundary •””le,r::- : – ,•, a•csEast Vellakinar Saravanampatti Road via Vcv School, there onwards So_+= :: _._ 5;:a!””lman",
            "Kovil Public Toilet Back Side via upto Pond, there onwardsEas, uptc Pe–_.?. – ::-:ari."
          ],
          "east": [
            "Starts from Periya Thottam, towards Southwest upto N.G. Pudur Junc!’ori",
            "Starts from N.G. Pudur Urumandampalayam Junction, tcwarcs :. e : Crossing"
          ],
          "south": [
            "Urumandampalayam Railway Track, Kongunadu College via Cross “9 ‘.’e:-:c,palayam Road upto G,N, Mills Bus Stop.",
            "Starts from Gn Mills Bus Stop, Mettupalayam Road via towards Ncr:n S””,a::, Residency"
          ],
          "west": [
            "Srivatsa Enclave, including Aditya Residency upto Selva \\,:;13:_-.·a•.2· “\\ lil. there onwardsNorth Murugan Nagar via towards West, Karthik .A.ver,;_e .”‘ Gurusami Nai;;ar Boundary, there onwardsEast Vkl Nagar Main Road via ;,ptc P- 1 a,- ,:;–;:;aia Tower, there onwardsNorth Mettupalayam Road via l:jfl)io Chinnavecarrpa:-: :::C–"
          ]
        }
      },
      {
        "ward_number": "15",
        "ward_name": "Ward 15",
        "directions": {
          "north": [
            "Starts from Kanuvai Sanganoor Pallam ridge, towards East Thotta Salai via Srinivasa Nagar, Swathi Garden Boundary via Rajalakshmi Nagar, including Thirupathi Nagar,Dhamu Garden via upto Subramaniampalayam Priya Hostel."
          ],
          "east": [
            "Starts from Subramaniampalayam Priya Hostel, towards South Ganesh Nagar, Mkg Lay Out via upto Government lti."
          ],
          "south": [
            "Starts from Government lti, towards West, Vivek Nagar, Mana! Thottam. A1antha Nagar Subramaniyam Palayam, Burial Ground Boundary via Sakthi Avenue, Thirumalai Garden, Jmv Garden via Kng Pudur upto Kanuvai Sanganoor Pallam Bridge."
          ],
          "west": [
            "Starts from Kng Pudur Bridge, Kng Pudur Mariamman Koil via Pichanda Gounder Thottam via Kanuvaisanganoor Pallam Boundary upto Yuvabharathi School."
          ]
        }
      },
      {
        "ward_number": "16",
        "ward_name": "Ward 16",
        "directions": {
          "north": [
            "Starts from K.N.G, pudur running towards west through Sri Vari Garden, M.GR Nagar ends up to KasiNanajeGounderPudurSanganoorPallam."
          ],
          "east": [
            "Starts from SommayampalayamPanchayat boundary running towards north through PeriyannaNagar,Luna Nagar, Ganesh Nagar and Raj Garden ends up to K.N.G.Pudur."
          ],
          "south": [
            "Starts frnm Saogaooo,Pallam ruoafog to=cds so,th thrn”gh Laod Mact< Ctty. Ad,aofl Nagar, Sabari Garden, Saravana Nagar and T.V.S Nagar road and ends uptoK marajNagar,Church Road (Thadagam Road)."
          ],
          "west": [
            "Starts from church road running towards uptoSomayampalayamPanchayat boundary east through ThatsunThottam ends"
          ]
        }
      },
      {
        "ward_number": "17",
        "ward_name": "Ward 17",
        "directions": {
          "north": [
            "Starts from Mullai Nagar running towards west through I.T Nagar. Thenurcil Nagar and Cheran Nagar ends up to Mettupalayam Roads."
          ],
          "east": [
            "Starts from Nataraj Nagar, Kanya Nagar, and Co-Operative Colony running towards north through SanganoorPallam ends up to Mullai Nagar"
          ],
          "south": [
            "Start from Union Road running towards east through Ashok Nagar, Kanna;nmal Nagar, Prem Avenue, T.V.S Nagar, Ram Nagar and Devi Garden and ends up to Nataraj Nagar."
          ],
          "west": [
            "Starts from Mettupalayam road running towards south ends up to Union Road."
          ]
        }
      },
      {
        "ward_number": "18",
        "ward_name": "Ward 18",
        "directions": {
          "north": [
            "Starts from Existing Coimbatore North Assembly Constituency’s Northern Boundary and upto Vellakinar Chinnavedampatti Village’s Southern Boundary."
          ],
          "east": [
            "Starts from The Junction Of Nallampalayam Road and Ganapathy, Sanganoor Village Boundary towards South Along Ganapathy Village Boundary upto Rajiv Gandhi Road."
          ],
          "south": [
            "Starts from Ganapathy Village Boundary and Rajiv Gandhi Road Junction, towards West Rajiv Gandhi Road via Nallampalayam Road, there onwards South Sanganoor Road, there onwards West S.P. Kannusami Main Road Northern Boundary (Saranganoor Road) via Crossing Railway Track upto Mettupalayam Main Road."
          ],
          "west": [
            "Starts from Mettupalayam Road, Compost Yard Bridge, towards North Along Mettupalayam Road (Eastern Part) Crossing Railway Quarters upto Vellakinar Village Boundary."
          ]
        }
      },
      {
        "ward_number": "19",
        "ward_name": "Ward 19",
        "directions": {
          "north": [
            "Starts from Udayampalayam Roadcamford School, towards South Bharathiar Road via Maniakaranpalayam, there onwardsEast Ravindranath Tagore Road via Crossing Athipalayam Road Junction upto Sathy Road Junction."
          ],
          "east": [
            "Starts from Sathy Road (Rama Krishna Mill) Junction, towards South Crossing Aihipalayam Road Junction, via Sathy Road, upto Anna Nagar Junction (Surya Hospital)."
          ],
          "south": [
            "Starts from Sathy Road Anna Nagar Junction ( Surya Hospital) towards West Maniyakaranpalayam Road via Abirami Nagar. Kandasami Nagar, Karpaga Vinayakar Nagar, there onwards Abutting Canal towards West Rajiv Gandhi Road via upto Balamurugan Nagar Boundary."
          ],
          "west": [
            "Starts from Balamurugan Nagar Abutting Canal towards North Maniakaranp,liayam Burial Ground, Saratha Garden, Elango Nagar. Nehru Nagar via Crossing Sankaralinganar Road, via Aranmanai Thottam, upto Udayarnpalayam Road Camford School."
          ]
        }
      },
      {
        "ward_number": "20",
        "ward_name": "Ward 20",
        "directions": {
          "north": [
            "Starts from Sathy Road Ramakrishna Mill Junction, towards North including Nalli Mudaliyar Lay Out, Crossing Sathy Road, towards East Vilankurichi Road. via Ganapathy r-.:1aanagar upto Block I Eastern Boundary (upto Ellai Amman Kovil)."
          ],
          "east": [
            "Starts from Vilankurichi Roadganapathy Maa Nagar Eastern Boundary (Ellai Amman Kovil) towards South, via Ganapathy Village Boundary, upto Ganapathy Maanagar 3rd Block Southern Boundary."
          ],
          "south": [
            "Starts from Ganapathy Maanagar 3rd Block Southern Boundary towards West, via Ganapathy Maanagar 4th Block, Om Sakthi Nagar Extension, Crossing Police Quarters Road, Abutting K.K. Nagar Eastern Boundary, Thendral Nagar, Fci Colony, via Balu Garden, Reaching Fci Road, Crossing Fci Godown Gate, towards North. Air Nagar. Yogiram Nagar, including Bpc Colony, Subash Nagar via Fci Road Bothsides upto Sathy Road Junction, Ganesh Garden via Reaching Athipalayam Road Junction. Then towards East Om Parasakshi Mill Road. Parasakthi Naga,, K. Kamaraj Nagar, via V.G.Rao Nagar Phase Ii Part, Then towards West I<.R.G. Nagar. K.P.G. Nagar, Vaikkal, Crossing Kannimar Nagar, pto Sakthi Road Maniyakaranpalayam Road Junction."
          ],
          "west": [
            "Starts from Sathy Roadmaniakaranpalayam Road Junction (Includes Sathy Road), Sathy Road via towards Nolih Crossing Athipalayam Road Junction, upto Sathy Road Ramakrishna Mill Junction."
          ]
        }
      },
      {
        "ward_number": "21",
        "ward_name": "Ward 21",
        "directions": {
          "north": [
            "Starts from Elango Street Sarathi Stores, towards East Sivanandapurarn 1 Street via Saihy Road, there onwardsNorth Sri Vetri Vinayakar Nagar via towards East upto Vinayakapuram 8th Street, upto Saravanampatti Village Boundary."
          ],
          "east": [
            "Starts from Vinayakapuram 8th Street (Saravanampatti Village Boundary), towards South Sundaram Street, Eastern Boundary via upto Vilankurichi Road."
          ],
          "south": [
            "Starts from Sundaram Street Vilankurichi Road Junction, towards West Crossing Sathy Road, towards North, via Lgb Nagar upto Saravanampatti Village Boundary."
          ],
          "west": [
            "Starts from Saravanampatti Village Boundary, via Thiruvalluvar Street Western Boundary, towards North via Elango Street, towards East upto Sarathi Store."
          ]
        }
      },
      {
        "ward_number": "22",
        "ward_name": "Ward 22",
        "directions": {
          "north": [
            "From Sivaram Nagar towards East via Vinayagapuram Road upto Bridge near Southern Side of RJ School"
          ],
          "east": [
            "From Bridge near Southern Side of RJ School upto Vilankurichi Main Road then towards East upto Kanchimaa Nagar then towards South upto Sasi West Avenue"
          ],
          "south": [
            "From Sasi West Avenue towards West via Southern Boundary of Sasi West Avenue, Kumutham Nagar Crossing Vilankurichi Road then towards West upto West End of Udhaya Nagar"
          ],
          "west": [
            "From West End of Udhaya Nagar towards North via West Boundary of Udhaya Nagar upto Sivaram Nagar"
          ]
        }
      },
      {
        "ward_number": "23",
        "ward_name": "Ward 23",
        "directions": {
          "north": [
            "From Sasi Avenue towards East via Texpark Road upto Kalapatti Road Junction towards South upto SITRA Avinashi Road Junction then towards NorthEast via Nortl1ern Boundary of Avinashi Road upto RG Pudur"
          ],
          "east": [
            "From RG Pudur towards south via Eastern side of GKR Nagar and Airport then towards south upto lrugur Town Panchayat Boundry"
          ],
          "south": [
            "From lrugur Town Panchayat Boundary towards West via upto Southwest End of Airport Boundary."
          ],
          "west": [
            "From West End of Udhaya Nagar towards North via West Boundary of Udhaya Nagar upto Sivaram Nagar"
          ]
        }
      },
      {
        "ward_number": "24",
        "ward_name": "Ward 24",
        "directions": {
          "north": [
            "From Gowthamapuri Nagar Channel towards East via lndt,u Maa Nagar Corssing Vilankurichi Road towards East via Shanthi Farms upto NRI Garden"
          ],
          "east": [
            "From NRI Garden towards South via CODISSIA Road Crossing Avinashi Road towards Souih upto Southf;ast Corner of Govt.poly Tech Compound Wall"
          ],
          "south": [
            "From SouthEast Corner of Govt. Polytechnic Compund Wall towards West via Jaganathan Nagar, Railway Line Crossing Kamarajar Road via Avinashi Road towards west upto Argus Nagar then towards South via Argus Nagar and Sothern Boundary of Kalyanasundaram Street, Sasthiri Street, voe Street, Bharathi Street, Nehru Street upto Funmall Road Junction."
          ],
          "west": [
            "From Fun Mall Road and Nehru Street Junction towards North via Funmall upto Avinashi Road then towards East via Southern Boundary of Avinashi Road towards East upto Masakalipalayam Road Junction and Crossing Avinashi Road towards North via Thanneer Pandhal Road towards West Crossing Anna ma Nagar, Jai Nagar then towards North Telecom Colony Crossing Vilankurichi Road upto Gowthamapuri Channel"
          ]
        }
      },
      {
        "ward_number": "25",
        "ward_name": "Ward 25",
        "directions": {
          "north": [
            "Starts from Sundaram Garden Western Boundary. towards East Annai Velankanni Nagar, Kristhuraj Nagar, Vetri Vinayakar Nagar Extension via upto Tamil Nadu Housing Board."
          ],
          "east": [
            "Starts from Tamil Nadu Housing Board Quarters, towards South Kongu Nagar, Gandhj Maanagar Eastern Boundary onwards. towards South Uzhagazhandha, Thrumal Kovil, Corporation Sewage Motor Room via upto Gandhi Maanagar Police Station"
          ],
          "south": [
            "Starts from Gandhi Maanagar Police Station, towards West Gandhi Maanagar Bus Terminal via Fci Road via upto Balu Garden."
          ],
          "west": [
            "Starts from Fci Road Balu Garden Junction, towards North Police Quarters via Abutting K.K. Nagar East Boundary, Crossing Police Quarters Road, upto Sundaram Garden Northern Boundary"
          ]
        }
      },
      {
        "ward_number": "26",
        "ward_name": "Ward 26",
        "directions": {
          "north": [
            "Starts from Fci Road Sriram Nagar Western Boundary. towards East. Conapathytnhb Hudco Colony, upto Canal’s Eastern Boundary."
          ],
          "east": [
            "Starts from Ganapathytnhb Hudco Colony, upto Canal’s Eastern Boundary. towards South via Canal, including Corporation Garbage Transfer Station, Crossing V.K. Road, towards South, Cape Neem Land, Industrial Estate, Balaguru Garden.via Pkc! Nagar, upto Avinashi Road Junction."
          ],
          "south": [
            "Starts from Pkd Nagar Avinashi Road Junction, towards West Avinashi Road North Side upto Vilankurichi Road Junction."
          ],
          "west": [
            "Starts from Avinashi Road Vilankurichi Road Junction. towards North via Ad Colony, V.R. Lay Out, via Black Mariamman Kovil. Crossing Railway Line, via Ganapathytnhb, Hudco Colony Western Boundary, Crossing Murugan Nagar. upto Sriram Nagar Western Boundary Fci Road Junction."
          ]
        }
      },
      {
        "ward_number": "27",
        "ward_name": "Ward 27",
        "directions": {
          "north": [
            "Starts from Prp Garden Northwest Boundary. towards East Abutting Railway Line. Crossing Peelamedu Railway Station, via Giriamman Kovil Street, V.K. Roao Junction"
          ],
          "east": [
            "Starts from V.K. Road Flyover, towards South, upto Avinashi Road Junction."
          ],
          "south": [
            "Starts from V.K.Road Avinashi Road Junction, towards West, Abutting Avinashi Road Northern Boundary, upto Stv Nagar Western Boundary"
          ],
          "west": [
            "Starts from Avinashi Road Stv Nagar Western Boundary Abutting Canal ‘towards North Bharathi Colony, Surya Garden, Crossing Mahatma Gandhi Road. via Sinthi Nagar, Crossing Rajagopal Lay Out, Bhurani Colony. upto P R.P. Garden."
          ]
        }
      },
      {
        "ward_number": "28",
        "ward_name": "Ward 28",
        "directions": {
          "north": [
            "Starts from. V.G. Rao Nagar Phase Ii Western Boundary Canal, towards East via V.G.Rao Nagar. Phase I, towards North Abutting Varadharajulu Nagar Northwest Boundary, towards East upto Fci Road Junction.",
            "Starts from Fci Road Varadharajulu Nagar Junction, towards South. Exservicemen Colony, including Fci Godown. Crossing Railway Line towards South."
          ],
          "east": [
            "Elango Nagar, via Thiru Veesar Nagar, Crossing Canal upto Crimson Dawn Apartment 1 Eastern Boundary, Abutting Canal towards South, upto Avinashi Road Junction (Raddisson Blue Hotel)."
          ],
          "south": [
            "Starts from Avinashi Road Stv Nagar Western Boundary Abutting Canal towards North Bharathi Colony, Surya Garden, Crossing Mahatma Gandhi Road. via Sinthi Nagar, Crossing Rajagopal Lay Out, Bhurani Colony. upto P R.P. Garden."
          ],
          "west": [
            "Starts from Avarampalayam Pnp Road Sanganur Pallam, towards North Jayasimhan Street, via Balasundaram Road, towards East via Pattalamman Kovil Street, Crossing Canal, Crossing Railway Line, Mahatma Gandhi Nagar, upto V.G. Rao Phase Ii Western Boundary Canal."
          ]
        }
      },
      {
        "ward_number": "29",
        "ward_name": "Ward 29",
        "directions": {
          "north": [
            "Starts from Sanganur Road Periyar Street Southern Boundary, towards South Sathy Road, there onwardsNorth including Sathy Road. Crossing Ganapathy Bus Terminal upto Maniyakaramralayam Road Junction (Surya Hospital)."
          ],
          "east": [
            "Starts from Sathy Road Maniyakaranpalayam Junction, towards South via Sathy Road, via Kattabomman Street, towards East Maruthaiya Nagar, Abutting Canal towards South Chinnasami Nagar, Vns Nagar, Korathottam upto Railway Bridge."
          ],
          "south": [
            "Starts from Railway Bridge, towards West, Abutting Railway Line, via Kumaran Nagar. Crossing Avarampalayam Road, Abbanaidu Lay Out, via Textool Company Southern Boundary, Crossing Sathy Road, Abutting Ganapathy Pudur 1 To 3 Streets Southern Boundary, towards West, upto Balan Nagar Railway Gate (Sekkon Tholtam)."
          ],
          "west": [
            "Starts from Balan Nagar Railway Gate onwardsNorth Tharani Nagar via Crossing Ganapathy Pudur $tree! 10, upto Sanganur Road Periyar Street Southern Boundary."
          ]
        }
      },
      {
        "ward_number": "30",
        "ward_name": "Ward 30",
        "directions": {
          "north": [
            "Starts from Rajiv Gandhi Road Jayaprakash Nagar Junction. towards East Canal Southern Boundary via Poonthottam, Moogambikai Nagar via Maniakaranpalayam Road. there onwards South upto Old Sathy Road Junction."
          ],
          "east": [
            "Starts from Maniyakaranpalayam Road Old Sathy Road Junction, towards South Sathy Road, Crossing Ganapathy Bus Stand upto Sathy Road Sanganoor Road Junction (Kannari Department Store)."
          ],
          "south": [
            "Starts from Maniyakaranpalayam Road Old Sathy Road Junction, towards South Sathy Road, Crossing Ganapathy Bus Stand upto Sathy Road Sanganoor Road Junction (Kannari Department Store)."
          ],
          "west": [
            "Starts from Senthil Nagar, towards North Rayappa Nagar Crossing Sanganoor Main Road, Vijayalakshmi Lay Out, upto Ganesh Lay Out Western Boundary, there onwards North Rajiv Gandhi Road upto Jayaprakash Nagar Junction."
          ]
        }
      },
      {
        "ward_number": "31",
        "ward_name": "Ward 31",
        "directions": {
          "north": [
            "Nallampalayam road to east Rajiv Gandhi road SF No.497, & 496 towards South edge of Ganapathy and Sanganoor Village boundaries SF No.502 Sanganoor Village till lttari then I towards East near Vannan Temple North South and East West Junction of ltter1."
          ],
          "east": [
            "From Vannan Temple towards South S.F.315, 314, 302, 201 & 298 till Rayappa Layout and towards south till Railway line main road."
          ],
          "south": [
            "Coimbatore to Chennai Railway track Junction towards Chekkan Thottarn Road till Muthukumar Layout Road Junction.Then towards North’ till Railway track then along the Railway track till Periyasamy Layout."
          ],
          "west": [
            "From Sanganoor Road Junction to Periyasamy Layout to South till Coimbatore to Chennai Railway track then towards West till Sastri Street then towards East upto Nehru Street. then towards South upto Sambath Street. Till Sanganur Pallam."
          ]
        }
      },
      {
        "ward_number": "32",
        "ward_name": "Ward 32",
        "directions": {
          "north": [
            "Sanganoor Mettupalayam Railway Track to Sanganoor Road Junction, towards East Thayir ltteri Road Junction then to North SF No.104 till South West Junction."
          ],
          "east": [
            "From Nallampaiam road Rajivgandhi road Junction to South then along sanganur road to south till Railway track"
          ],
          "south": [
            "From Coimbatore to Chennai Southern Railway line level Crossing to West of SF No.162 till Sanganoor Pallam Railway line."
          ],
          "west": [
            "Coimbatore to Chennai Railway line to via SF No.162 towards North Western edge of Sanganoor Pallam, Mettupalayam Road (Near TTC) till Eru Company Bridge."
          ]
        }
      },
      {
        "ward_number": "33",
        "ward_name": "Ward 33",
        "directions": {
          "north": [
            "Starts from junction of Mettupalayam Road and Union Road running -wards west through Kammaraj Nagar, Meenatchi Nagar, SanganoorPallam and rear side of Panchayat Office Road ends up -JawagarNagar."
          ],
          "east": [
            "Starts from Mettupalayam Road running -wards north ends up – Union Road."
          ],
          "south": [
            "Starts from Onapalayam Road running -wards east through S.K.R Nagar ends up -Jeeva Nagar (Mettupalayam Road)."
          ],
          "west": [
            "Starts from Jawagar Nagar running -wards south through Nataraj Nagar ends up – N.K.NagarOnapalayam Road."
          ]
        }
      },
      {
        "ward_number": "34",
        "ward_name": "Ward 34",
        "directions": {
          "north": [
            "Starts from E.B Colony running towards east through Poombugar Nagar . Onapalayam Road ends up to S.K.R Nagar."
          ],
          "east": [
            "Starts from S.K.R Nagar running towards south through Mettupalayam Road ends up to Jeeva Nagar."
          ],
          "south": [
            "Starts from Jeeva Nagar running towards west through K.K.Pudur Road Subbammal La.yout Giri Nagar and,Manjeeswari Colony and ends up to Professor’s Colony."
          ],
          "west": [
            "Starts from K.K.Pudur road running towards north through Professor’s Colony, Sowdambigi Nagar, Edayarapalayam Road ends up to E.B. Colony."
          ]
        }
      },
      {
        "ward_number": "35",
        "ward_name": "Ward 35",
        "directions": {
          "north": [
            "Starts from Periyannan Nagar running towards west through Kannadasan Street new Weavas Colony ends uptoThadagam Road"
          ],
          "east": [
            "Starts from Thadagam Road runnings towards south through Pari Nagar ends up to Edayarapalayam Road"
          ],
          "south": [
            "Starts from Edayarapatayam Road running towards east through from Corporation Mayanam west, V.O.C Nagar west. coolie Nesavalar Colony and Masani Amman Nagar ends up to Anna Nagar."
          ],
          "west": [
            "Starts from Anna Nagar, P.F.Colony running towards north through Lakshmi Nagar• Gandhi Nagar ends up to Vivekanandha Street ,Periyannan Nagar"
          ]
        }
      },
      {
        "ward_number": "36",
        "ward_name": "Ward 36",
        "directions": {
          "north": [
            "Starts from East side of Edayarpalayam road and runs towards West K.K.R Nagar"
          ],
          "east": [
            "Starts at South side of New Anandha Nagar and runs wards Super Garden- Edayarpalayam junction"
          ],
          "south": [
            "Starts from West side of AlameluMangai Avenue and runs towards via Thondamuthur road junction,Vadavalli Bus Terminal,Gopalapuram and New Anandha Nagar"
          ],
          "west": [
            "Starts from North side K.K.R Nagar runs towards South Mangai Avenue"
          ]
        }
      },
      {
        "ward_number": "37",
        "ward_name": "Ward 37",
        "directions": {
          "north": [
            "Starts from East side of Happy Garden and runs towards Westenside of Nalvar Nagar."
          ],
          "east": [
            "Starts from Marudhamalai Main Road and PerumalKoil Street junction and run towards North side upto Happy Garden."
          ],
          "south": [
            "Starts from West side of Kalveerampalayam junction and Runs towards East side and ends at PerumalKoil Street junction (Mouthi Hospital Road)."
          ],
          "west": [
            "Starts at Nalvar Nagar and runs towards South side of Thondamuthur road and ends at Kalveerampalayam"
          ]
        }
      },
      {
        "ward_number": "38",
        "ward_name": "Ward 38",
        "directions": {
          "north": [
            "Starts from East Side of KoothandavarKovil Street and runs towards ArunNagar,Curio Garden,Kalveerampalayam junction and Marudhamalai Main Road."
          ],
          "east": [
            "Starts from South’ side of MahalakshmiKovil junction and runs towards North-East to KoothandavarKoil Street-Marudhamalai road Junction."
          ],
          "south": [
            "Starts from West side of Onapalayam and runs towards East to Thondamuthur Road and North side Amman Nagar and ends at Thondamuthur road and MahalakshmiKoil Junction."
          ],
          "west": [
            "Starts from North side of MarudhamalaiAdivaram and runs towards South upto Taunsa Nagar and Onapalayam."
          ]
        }
      },
      {
        "ward_number": "39",
        "ward_name": "Ward 39",
        "directions": {
          "north": [
            "Starts from.East Side Of Thondamuthur Road Junction.Maharani Avenue and towards West To Jayalakshmi Nagar."
          ],
          "east": [
            "Starts from South Side Of Anna Nagar and Runs towards North To Vadavalli-ThondamuthurRoad Junction."
          ],
          "south": [
            "Starts from West Side Of Sundapalayam and Runs towards East Side To Sathya Colony and Ends At Anna Nagar."
          ],
          "west": [
            "Starts from North Side Of Jayalakshmi Nagar and Runs towards South To Sundapalayam."
          ]
        }
      },
      {
        "ward_number": "40",
        "ward_name": "Ward 40",
        "directions": {
          "north": [
            "Stars from North Side of Selvam Nagar and Runs towards West of Rajiv Gandhi Nagar, V.N.R Nagar and Thondamuthur road Junction and Ends At Vernbu Avenu."
          ],
          "east": [
            "Starts from Southside of Veerakeralam Junction and Runs towards Veerakeralam Maindhan and Ends at maridharnalai road Selvam Nagar."
          ],
          "south": [
            "Starts from West Side of Ragavendra Garden and Runs towards thondarnuthur road Thondamuthur Road, Yeetakeralam Junction."
          ],
          "west": [
            "Starts from North Side of Thondamuthur Road , Vembu Avenue Runs towards Siruvani Road and Ends at Ragavendra Garden Junction."
          ]
        }
      },
      {
        "ward_number": "41",
        "ward_name": "Ward 41",
        "directions": {
          "north": [
            "Starts from Vadavalli Village boundary and north side of Agriculture University field junction runs through agriculture fields up to S.F.Number 462 and turns towards south."
          ],
          "east": [
            "Starts from agricultureField S.F.Number462 runs towards south along S.F.Number462 up to northern boundary ofGogulamColony S.F.Number402 and turns towards west along north boundary of Gogulam Colony (S.F.Number 403) up toGogulam Colony 4th Street and again turns – towards south up toMaruthamalai Road Junction and turns towards eastalong Northern side or Maruthamalai Road up toJunction of KanuvaiPallam and turns towards southalong the KanuvaiPallamboundary up to S.F.Number 234"
          ],
          "south": [
            "Starts from junction of KanuvaiPallam and eastern boundary of S.F.Number 234 runs towards west alongBharathiar Street up to Nethaji Road Junction. Then turns towards north and runs along the western boundary of Nethaji Road up to Anna statue junction turns towards west along the southern boundary of Anna Statue up to the eastern boundary of S.F.Number 250 and turns towards south along S.F.Number 252 and turns towards west along S.F.Number 252 and 261 up to S.F.Number 276 and turns towards north along S.F.Number 276 and 278 up to S.F.Number 278 and turns towards west and runs up to Veerakeralam Village boundary"
          ],
          "west": [
            "Starts from East side of Veerakeralam Village boundary and northern side of Ponnusamy Nagar, Jagathesh Nagar Layout runs towards north along Veerakeralam Village boundary up to Thirumalainaickenpalayam Village northern side"
          ]
        }
      },
      {
        "ward_number": "42",
        "ward_name": "Ward 42",
        "directions": {
          "north": [
            "Starting from, Sasthri Road, M.G.R Colony junction, towards v.o.c. Nagar Kannapiran, Nagarandavasi Nagar running Thadagam Road, and Sivakamy Nagar Road Junction"
          ],
          "east": [
            "Starting from thadagamRoad, Sasthri Street Junction towards Martha konar street thadagam road Dr.Ambthakar Street Junction"
          ],
          "south": [
            "Starting from thadagam Road, Dr.Ambathkar Street Junction. Anna Nagar towards thekallur Road Dr.Ambathkar Street Junction"
          ],
          "west": [
            "Starting from Dr.Ambathkar Road, thekallur Road Junction to Bharathiyar Street towards Nallammal Street, Sasthri Street"
          ]
        }
      },
      {
        "ward_number": "43",
        "ward_name": "Ward 43",
        "directions": {
          "north": [
            "Starting from ThadagamRoad , Simson Nagar Junction , towards K.K.Pudur Road and Kalyani Nagar RuningK.K.PudurmaniamVellappar Street"
          ],
          "east": [
            "Starting from K.k.pudurManiamVellappar Street towards ManiamMaruthakutty Junction"
          ],
          "south": [
            "Starting from ManiamVellappar Street, Maniam Maruthakutty street Junction towardsK.G.Layout RuningThadagam road Ramasamy Street"
          ],
          "west": [
            "Starting from Thadagam Road Ramasamy Street Junction towards Thadagam Road running Junction towards Thadagam Road Runing K.K.Pudur Junction."
          ]
        }
      },
      {
        "ward_number": "44",
        "ward_name": "Ward 44",
        "directions": {
          "north": [
            "Starting from Thadagam Road Ramasamy Street Junction , towards K.G.Layout Runs Maniam Maruthakutty Street, ManiamVellappar Street Junction."
          ],
          "east": [
            "Starting from Maniam Maruthakutty Street, Mani Vellappar Street.. -zoward Alagannan Street Runing NSR Road Junction"
          ],
          "south": [
            "Starting from NSR Road , Alagannan Street towards N SR Road RuningThadagam Road"
          ],
          "west": [
            "Startinmg from NSR Road, Thadagam Road towardsRamasamy Street, Runir,gThadagam Road Junction"
          ]
        }
      },
      {
        "ward_number": "45",
        "ward_name": "Ward 45",
        "directions": {
          "north": [
            "Starts from Mania’mvellappan Street Junction Jeeva Street Runs To Mtp Road (IRF Sandhu)."
          ],
          "east": [
            "Starts from Mtp Road (IRF Sandhu), towards Karunanithi Nagar Runs Mtp Road SaibabaKovil."
          ],
          "south": [
            "Starts from Mtp Road Sai Baba Kovil (NSR Road) Junction Toward Alilgannan Street Runs NSR Road Junction."
          ],
          "west": [
            "Starts from Alaganna Street NSR Road Junction Runs ManianVellappan Street K.K.Pudur Road ManianVellappan Street."
          ]
        }
      },
      {
        "ward_number": "46",
        "ward_name": "Ward 46",
        "directions": {
          "north": [
            "from Mettupalayam Road Railway track SF No.162 to North East direction via Railway track Rathinapuri till Sastri Street then turn to East till Nehru Street."
          ],
          "east": [
            "from Coimbatore Chennai Ratlway track Mathiazt1″a.Qan-Stf8et East Junctioi1 to South via Nehru Street till Sampath Street."
          ],
          "south": [
            "from Sanganoor Pallam Sampath Street Junction to West till Sastri Street. including Sastri Street to North West direction till 105 Feet Bridge then turn West till Kozhikooe to Chennai railway track."
          ],
          "west": [
            "from Sanganoor Pallam Sampath Street Junction to West till Sastri Street. including Sastri Street to North West direction till 105 Feet Bridge then turn West till Kozhikooe to Chennai railway track."
          ]
        }
      },
      {
        "ward_number": "47",
        "ward_name": "Ward 47",
        "directions": {
          "north": [
            "Junction of Coimbatore to Chennai Railway track towards Chekkan Thottam Road till Muthukumar Layout Road Junction."
          ],
          "east": [
            "Junction of Ganapathy” Main road Coimbatore to Chennai Railway track to·H,.11ds South till Sanganoor Pallam."
          ],
          "south": [
            "from Junction of Sanganoor Pallam at Ganapathy Main Road towards West via Sanganoor Paffam till Gandhipuram 7th Street Extension Bridge and Amarar Jeeva- Street till Sampath Street’."
          ],
          "west": [
            "Starting from Sanganoor Pallam towards North of Sampath Street till Coimbatore to Chennai Railway track."
          ]
        }
      },
      {
        "ward_number": "48",
        "ward_name": "Ward 48",
        "directions": {
          "north": [
            "from Sanganoor Pallam at Sathy road towards East Sanganoor Pallam via South bund upto Ramakrishna Kalyana Mandapam."
          ],
          "east": [
            "Aerimedu and Parameshwarar Layout Junction towards South Parameswarn Layout West boundary, SNR Scheme Road New bridge to South till Avinashi Road Junction."
          ],
          "south": [
            "from V.K.K Menon Road Bharathiyar Road Junction towards West till South end of Sathy Road Bharathiyar Road Junction then Southern side of Ponne Street towards West till Gandhipuram 4th Street."
          ],
          "west": [
            "from Ponne Street Gandhipuram 4th Street West Portion towards North. Starting of SF No. 161 to Northern side of Church near Sanganoor Pallam Northern boundary."
          ]
        }
      },
      {
        "ward_number": "49",
        "ward_name": "Ward 49",
        "directions": {
          "north": [
            "from Balasundaram Road and NG Ramasamy Road junction towards East NG Ramasamy Road (North side) till Nethaji Road again towards North GKT, GKS Nagar via Southern boundary upto Parameswaran Pillai Street again towards North upto Aeri Medu Sanganoor Pallam then Aerimedu Parameswarwan Layout Sanganoor Pallam SNR Scheme Road New bridge to towards South Sanganoor Pallam Junction of Avinashi road."
          ],
          "east": [
            "from Balasundaram Road and NG Ramasamy Road junction towards East NG Ramasamy Road (North side) till Nethaji Road again towards North GKT. GKS Nagar via Southern boundary upto Parameswaran Pillai Street again towards North upio AerimeC:u Sanganoor Pallam then Aerimedu Parameswarwan Layout Sanganoor Pallam SNR Scheme Road New bridge to towards South Sanganoor Pallam Junction of Avinashi road."
          ],
          "south": [
            "from AvinastJi Road Nava India Road Junction to Avinashi Road Lakshmi mills Junction."
          ],
          "west": [
            "from Avinashi Road Lakshmi mills Junction to North via Bharathiyar Road turn towards West upto Avarampalayam Road Junction."
          ]
        }
      },
      {
        "ward_number": "50",
        "ward_name": "Ward 50",
        "directions": {
          "north": [
            "Starts from Sanganoor Pallam Near Avinashi Road EB office towards East via Avinashi Road up to Channel Near, Peelamedu Pudur, Avinashi Road Junction."
          ],
          "east": [
            "Starts from Channel Near Peelamedu pudur Avinashi Road Junction towards South via Channel Boundary up to Sowripalayam Annai Velankanni Nagar via Western Boundary of Rajiv Gandhi Nagar, Western Boundary of TNHB, RVL Colony up to VGM Hospital Road and Trichy Road Junction."
          ],
          "south": [
            "VGM Hospital Road and Trichy Road Junction towards West via Alvernia School, Trichy Road up to Sanganoor Pallam."
          ],
          "west": [
            "Starts at Trichy Road Near Alvernia School Sanganoor Pallam toward North via Sowripalayam Road Western Boundary of Meena Estate up to Sanganoor Pallam Near Avinashi Road EB Office."
          ]
        }
      },
      {
        "ward_number": "51",
        "ward_name": "Ward 51",
        "directions": {
          "north": [
            "from Channel Near Peelamedu pudur and Avinashi Road Junction towards East via Avinashi Road upto Mas.akalipalayam Road Junction"
          ],
          "east": [
            "from Avinashi Road Masakkalipalayam Road Junction towards South via Masakkalipalaym Road Crossing Periyar Nagar upto South Street and West Street Junction"
          ],
          "south": [
            "from South Street and West Street Junction towards West Crossing Funmall Road, towards West via Southern Boundary of PSG Hospital Crossing Sowripalayam Road, towards west upto Eastern Boundary of Chandragandhi Nagar then towards South via Eastern Boundary of Chandragandhi Nagar and along the Boundary of Kavetti Naidu Layout, via R.K.Garden, Gunc;Jukinar Thottam, Ranganayakiamman Nagar. Southern Boundary of Thirumagal Nagar and RK Mill Colony Channel Junction."
          ],
          "west": [
            "from Thirumagal nagar Southern Boundary and R.K.Mill Colony Channel Junction towards North via Channel upto Avinashi Road Near Peelamedu Pudur"
          ]
        }
      },
      {
        "ward_number": "53",
        "ward_name": "Ward 53",
        "directions": {
          "north": [
            "from Masakkalipalayam Road North East Boundary of Thandhai Periyar Nagar and Eastern Boundary of G.V.Residency Junction towards East Funmall Road and Masakkalipalayam Road Junction towards East via Masakalipalayam road upto South Street and West Street unction to North via Ramasamy Konar Street, Masakalipalayam Road towards East via Lakshmipuram 6th street upto Kamarajar Road"
          ],
          "east": [
            "from Kamarajar Road and Lakshmipuram 6th Street Junction towards south via Kamarajar Road upto Northern Boundary of ESI Hospital"
          ],
          "south": [
            "from Kamarajar Road and Northern boundary of ESI Hospital Junction towards West via Northern boundary of ESI Hospital then towards south via Gandhi nagar Road upto Varatharajapuram road towards west via Uppilipalayam Main Road Crossing Masakkalipalayam Road towards west via Uppilipalayam Road upto East Boundary of G.V.Residency and Channel Junction."
          ],
          "west": [
            "from Uppilipalayam Road and South east Boundary of G.V.Residency Junction towards North via Eastern Boundary of G.V.Residency upto Masakkalipalayam Road and North East Boundary of Thandhai Periyar Nagar Junction"
          ]
        }
      },
      {
        "ward_number": "54",
        "ward_name": "Ward 54",
        "directions": {
          "north": [
            "Kamarajar Road Valluvar Nagar Junction to East via North Boundary of Viluvar Nagar upto Railway Track"
          ],
          "east": [
            "from Valluvar Nagar Railway Track Jucntion towards Southeast via Railway Track upto Neelikonampalayam Railway Level Crossing"
          ],
          "south": [
            "from Neelikonampalayam Railway Level Crossing toward west via Neelikonampalayam Road, Sakkarai Chettiar’Road upto Kamarajar Road"
          ],
          "west": [
            "from Sakkarai Chettiar Road, Kamarajar Road junction towards North upto Kamarajar Road Valluvar Nagar Junction"
          ]
        }
      },
      {
        "ward_number": "55",
        "ward_name": "Ward 55",
        "directions": {
          "north": [
            "Jaganathan Nagar South End to via Airport Compound via Bharathi east Nagar Junction crossing SIHS Colony Road ueo Kaveri nagar."
          ],
          "east": [
            "from Kaveri nagar to soyth via eastern Boundary of Kaveri nagar road Iowan.is west upto SIHS Colony Road junction then towards south via Nethajipuram flyover upto Trichiy Road."
          ],
          "south": [
            "from Trichy Road SIHS Colony Road junction towards west upto Vasantha Mill Road Neelikonampalayam Road Junction."
          ],
          "west": [
            "Neelikonampalayam Vasantha Mill Road Junction to north via Railway Gate upto Jaganathan Nagar South End"
          ]
        }
      },
      {
        "ward_number": "56",
        "ward_name": "Ward 56",
        "directions": {
          "north": [
            "from SIHS Colony Road and Mahathma Gadhi Road Junction towards east via Mahathmagandhi Road upto North east of Lakshmi Vinayagar Nagar."
          ],
          "east": [
            "from MahathmaGandhinagar Road and north east end of Lakshmi Vinayaga nagar towards south via eastrn Boundry of Lakshmi Vinayaka nagar upto Sowdeshwan nagar road Junction."
          ],
          "south": [
            "from south east end of sowdeshwari nagar towards west via lrugur road upto Sungam then towards south via sungam ondipudhur road upto Trichy road then towards west via Trichy road upto SIHS Colony road Junction."
          ],
          "west": [
            "from Trichy road and SIHS Colony Road junction towards North via SIHS Colony Road upto Mahathma Gandhi Road junction."
          ]
        }
      },
      {
        "ward_number": "57",
        "ward_name": "Ward 57",
        "directions": {
          "north": [
            "from trichy Road lrugur lttery Thanneer Thottam to East upto Corporation Boundary lrugur Railway Gate Flyover Bridge"
          ],
          "east": [
            "lrugur Bridge via Tri_chy Road to South upto Noyyal River"
          ],
          "south": [
            "Noyyal River towards west via Northern boundary of Noyyal River upto Cheran Nagar"
          ],
          "west": [
            "from Cheran Nagar towards North Trichy Road via upto lrugur lttery Thanneer Thottam Street"
          ]
        }
      },
      {
        "ward_number": "58",
        "ward_name": "Ward 58",
        "directions": {
          "north": [
            "from Trichy Road Vasantha Mill Neelikonampalayam Junction towards East via Trichy Road upto Nesavalar Colony Trichy Road Junction"
          ],
          "east": [
            "Nesavalar Colony Trichy Road Junction towards South via Cheran Nagar Road upto Noyyal River"
          ],
          "south": [
            "from Cheran Nagar Road Noyyal River Junction towards West via Noyyal River upto Vellalore Bridge End upto Corporation Boundary"
          ],
          "west": [
            "Vellalore Road Under Bridge Corporation Boundary towards North via Vellalore Road, Anaiankadu Road upto Trichy road Vasantha Mill Neelikonampalayam Road Junction"
          ]
        }
      },
      {
        "ward_number": "59",
        "ward_name": "Ward 59",
        "directions": {
          "north": [
            "from ESI Hospital to East via Neelikonampalayam Road upto Neelikonampalayam Busstand"
          ],
          "east": [
            "from Neelikonampalayam Bus stand towards south via VasanthaMill Road upto Trichy Road police Quarters"
          ],
          "south": [
            "from Trichy Road Vasantha mill Road Junction towards West via Trichy Road upto Kamarajar Road Junction"
          ],
          "west": [
            "from Kamarajar Road Trichy Road Jucntion towards North via Kamarajar Road upto ESI Hospital"
          ]
        }
      },
      {
        "ward_number": "60",
        "ward_name": "Ward 60",
        "directions": {
          "north": [
            "From Uppilipalayam road Co-operative colony Road Junction towards East via Uppilipalayam road, crossing Masakalipalayam road towards east via Varatharajapuram road upto Gandhi nagar road then towards north via Gandhi nagar road upto Northwest Boundary of ESI Hospital then towards east upto North east Boundary of ES! Hospital and Kamarajar Road Junction."
          ],
          "east": [
            "From Northeast Boundary of ESI Hospital and Kamarajar road Junction towards south via Eastern Boundary of Kamarajar road upto Trichy road junction."
          ],
          "south": [
            "From Trichy Road Kamarajar Road Junction towards West via Trichy Road upto VGM Hospital Road."
          ],
          "west": [
            "Trichy Road VGM Hospital road towards North upto Southern Boundary of TNHB Colony then towards west along the boundary of TNHB Colony and upto 80′ Scheme Road then towards east upto Western Boundary of Co-operative colony road then towards north upto Uppilipalyam road Co-operative colony road Junction."
          ]
        }
      },
      {
        "ward_number": "61",
        "ward_name": "Ward 61",
        "directions": {
          "north": [
            "from Trichy Road Stock Exchange towards East upto Vasantha Mill Road Junction"
          ],
          "east": [
            "from Vasantha Mill Road Junction towards south via Anaiyankadu Road Crossing the Railway Line towards south via vellalore road upto Noyyal River"
          ],
          "south": [
            "from Noyyal River Vellalor Road Junction towards west via North boundary of Noyyal River upto Sanganoor pallam"
          ],
          "west": [
            "from Noyyal River towards North via Sanganoor Pallam upto Stock Exchange Trichy Road"
          ]
        }
      },
      {
        "ward_number": "62",
        "ward_name": "Ward 62",
        "directions": {
          "north": [
            "SF No.177 Part Anuparppalayam Village SF– No. 254, 253, 240, 239, 238, 192, 177, ‘244, towards East Nanjundapuram SF No 243,237,235,236.238 and 590 upto Ramanathapuram SF No.588"
          ],
          "east": [
            "from Trichy Road Alvernia Convent to South side of Sanganoor Pallam"
          ],
          "south": [
            "from Noyyal river upto Saramedu"
          ],
          "west": [
            "from Nanjundapuram road Eastern side portion upto Noyyal River"
          ]
        }
      },
      {
        "ward_number": "63",
        "ward_name": "Ward 63",
        "directions": {
          "north": [
            "from Trichy Road from TS No. 2891 to Trichy Road upto D.No 949."
          ],
          "east": [
            "from Sanganoor Pallam and Auto Colony Junction towards South upto Trichy Road Junction"
          ],
          "south": [
            "from Kannika Parameswari Layout Nanjundapuram Junction South Side TS No.29294 Kannika Parameswari Layout Ramalingam Layout upto South side boundary"
          ],
          "west": [
            "West of Nachiannan Angannan Street upto Trichy road."
          ]
        }
      },
      {
        "ward_number": "64",
        "ward_name": "Ward 64",
        "directions": {
          "north": [
            "from Sowripalayam Road Sanganoor Pallam Junction to towards West via Puliyakulam Road Junction towards South West direction upto Police Kandasamy Road"
          ],
          "east": [
            "from Sanganoor Pallam and Auto Colony Junction towards South upto Trichy Road Junction"
          ],
          "south": [
            "from Auto Colony North towards West along with Pankaja Mill Compound wall and towards South Pankaja Mill Compound Wall upto 90 Feet Scheme Road and towards West South Side of 50 Feet Scheme Road Pankaja Mill Road Door No.1818 turn towards South Pankaja Mil.I Road Eastern Boundary upto Trichy Road"
          ],
          "west": [
            "from Trichy Road towards North Police Kandasamy Road Puliyakulam Road Junction and Trichy Road upto Sanganoor Pallam"
          ]
        }
      },
      {
        "ward_number": "65",
        "ward_name": "Ward 65",
        "directions": {
          "north": [
            "from Trichy Road 949 towards West upto Sungam Junction via Valankulam Road upto Shivaram Nagar Road Junction"
          ],
          "east": [
            "from 100 Feet Road Ramanathapuram towards South upto Susheela Nagar"
          ],
          "south": [
            "from Susheela Nagar towards West upto Shivaram Nagar Road"
          ],
          "west": [
            "from Valankulam to South via Shivaram Nagar Road upto Railway track"
          ]
        }
      },
      {
        "ward_number": "66",
        "ward_name": "Ward 66",
        "directions": {
          "north": [
            "from Avinashi Road Junction of Ammankulam North side to towards West upto Avinashi Road Kamarajar Road Junction"
          ],
          "east": [
            "from Sanganoor,Pallam towards South till Sowripalayam Junction"
          ],
          "south": [
            "from Junction of East boundary towards West via Gandhinagar ward office towards Trichy Road then towards West upto East Club Road Junction"
          ],
          "west": [
            "from end of South Boundary towards North via West side of Club Road crossing Race Course till Thirugnanasambhandam Road towards East upto Kamarajar Road then towards North via Travellers Bungalow upto Avinashi Road"
          ]
        }
      },
      {
        "ward_number": "67",
        "ward_name": "Ward 67",
        "directions": {
          "north": [
            "Ponne Street near Swarnambika Layout towards East upto Vivekananda road turn towards South upto Sastri Road then towards East upto Nanjappa Road then towards North up to Gandhipuram Signal then towards East via VKK Menon Road till Avarampalayam Road."
          ],
          "east": [
            "from RTO Office Road to North via Women’s Polytechnic till VKK Menon Road Junction."
          ],
          "south": [
            "from RTO Office to towards West Dr.Nanjappa Road (United Kerala Auto Mobiles) then towards South Tyre Company then towards West via Northern side till J.Kunki Raman Merchant then towards South Bus stop near Bunk towards West upto Chellappa Pillai Street via Northern side till Railway track then Railway track near TS No. 13"
          ],
          "west": [
            "from TS No.1424 near Railway track towards North till Northern side of TS No.13"
          ]
        }
      },
      {
        "ward_number": "68",
        "ward_name": "Ward 68",
        "directions": {
          "north": [
            "from Mettupalayam Road Railway Track towards South East via Sanganoor Pallam South bund till SF No.383/1/A Dr.Alagappa Road."
          ],
          "east": [
            "from Sanganoor Pallam SF No.383/1/A and Dr.Alagappa Chettiyar Road Junction to Soutr Dr. Alagappa Chettiyar Road via East boundary Dr. Rajendra Prasad Road then via Gandhipuram 4th Street towards South upto Ponne Street then towards _East upto Nanjappa road then to South Nanjappa road towards West till Sastri Street."
          ],
          "south": [
            "Dr. Nanajappa Road Sastri Street Junction towards West via Sastri road North side till railway track."
          ],
          "west": [
            "Coimbatore Mettupalayam Railway track SF No. 46 towards South till railway track near Sastri Street."
          ]
        }
      },
      {
        "ward_number": "69",
        "ward_name": "Ward 69",
        "directions": {
          "north": [
            "N.S Ramasamy Street (South ) Thadagam Road from Venkitapuram towards East upto Mettupalayam Road then towards North upto ARC Signal Byepass Road then towards East till Railway track."
          ],
          "east": [
            "Mettupalayam Railway track from Sivanandha Colony bridge to towards South till TVS Company then along Mettupalayam Road towards South till Kikani bridge."
          ],
          "south": [
            "Kikani Bridge to towards West upto signal, Krishnasamy Mudaliyar road Verivada Chettiar road then towards West (Kamarajapuram Southern boundary) till Mettupalayam Road."
          ],
          "west": [
            "Mettupalayam Road (East side Verivada Chettiyar Road) to towards North till Bharathi Park Road Signal then towards West till GCT College Thadagam Road then towards North till Thadagam Road Venkitapuram NSR Road Junction."
          ]
        }
      },
      {
        "ward_number": "70",
        "ward_name": "Ward 70",
        "directions": {
          "north": [
            "From Mettupalayam Road Junction towards East upto Krishnaswamy Mudaliar Road then to North upto Kamarajapuram Signal then to East upto Kikani bridge."
          ],
          "east": [
            "From Railway Line Kikani Bridge to towards South upto Avinashi Road Bridge."
          ],
          "south": [
            "From Railway Track Avinashi Road Flyover to Mill Road (South) towards West."
          ],
          "west": [
            "From Krishnar Street to North upto Sukrawarpet Road then Sukrawarpet Road RS Puram DB Road Junction towards North upto Sundaram Street then to East upto Sundaram Street South then crossed Karanayellayar Lane towards Rangai Gounder Street then to North upto Theppakulam Junction then upto Mettupalayam Road Verivada Road Junction."
          ]
        }
      },
      {
        "ward_number": "71",
        "ward_name": "Ward 71",
        "directions": {
          "north": [
            "Starting from junction of Thadagam road and Cowly Brown road runs towards east uptoMettupalayam road."
          ],
          "east": [
            "Starting from the junction of Cowely Brown road and mettupalayam road and runs towards south boundary uptoSambandam road and runs towards south along the southern side of Mettupalayam road upto Ramachandra road"
          ],
          "south": [
            "Starting from the junction of Mettupalayam road and Ramachandra road runs towards west along the north side of Ramachandra road uptoD.B.Road and then towards north and runs towards north on the western of D.B.Road uptoThiruvenkatasamy road junction Coimbatore Corporation 49 Thondamuthur 11 and west runs towards west along the southern side of Thiruvenkatasamy road and ends with junction of Thadagam road and Thiruvenkatasamy road."
          ],
          "west": [
            "Starting from the Southern junction of Thiruvenkatasamy road and Thadagam road runs towards north along the eastern side of Thadagam road and ends with starting point of north"
          ]
        }
      },
      {
        "ward_number": "72",
        "ward_name": "Ward 72",
        "directions": {
          "north": [
            "Starts from the junction of Thiruvenkatasamy road & Thadagam road runs towards east along the south boundary of Thiruvenkatasamy road upto D.B.Road."
          ],
          "east": [
            "Starts from the junction of D.B.Road and Thadagam road runs towards south uptoRamachandra road then turns towards east uptoMettupalayam road then turns south runs along western side of Mettupalayam road and Range Gowder street ends with junction of Range Gowder street and ChinnaEllai lane."
          ],
          "south": [
            "Starts from the junction of Thadagam road and D.B.Road runs towards north through SukkaYarpet crosses Thadagam road ends with Thiruvenkatasamy road southern side."
          ],
          "west": [
            "Starts from the junction of Range Gowder street and ChinnaEflai lane runs towards west along the southern boundary of Sundaram street upto D.B.Road."
          ]
        }
      },
      {
        "ward_number": "73",
        "ward_name": "Ward 73",
        "directions": {
          "north": [
            "Starting from Thadagam road – Sundapalayam road junction towards west of northern side P.M sar-ny colony, Agri collage compound and then Northern side AA scheme road uptolowley road signal."
          ],
          "east": [
            "Starting from Lowley road signal towards southern side thadagamroad(western side) uptoTelungu street"
          ],
          "south": [
            "Starting from Telungu street – Thadagam road junction towards southern side Edaiyar street, telungu street junction uptoRamakrishnapuram"
          ],
          "west": [
            "Starting from Ramakrishnapuram towards western side chokkarnpudur road, Govindasamy layout, Leela apartment, Murugaiya layout, AK.Snagar, RayappapuramuptoThadagam road – Sundapalayam road junction."
          ]
        }
      },
      {
        "ward_number": "74",
        "ward_name": "Ward 74",
        "directions": {
          "north": [
            "Starts from the northern end of Gogulam colony 4th Street (S.F.NL;mber 403) runs towards East along the northern boundary of S.F.Number 403 and turns towards north a\\ong the western boundary of lndiranagarS.F.Nurnber 398 the turns towards east a long S.F.Number 459, 464, 465 Agri University fields and south side of G.C.T.CollegeuptoThadagam road (Eastern boundary) and again turns towards South runs upto junction of Bharathi Park Road and Thadagam Road. Then runs from the Junction of Bharath Park Road upto Western boundary of Home Science College campus and again turns towards south along the western boundary of Home Science College campus. Then turns towards east runs _along the northern boundary of Forest College campus upto western side of the Mettupalayam Road. from Thadagam Road Junction towards Up To TegalurRoaCtiannea"
          ],
          "east": [
            "Starts from the junction of Mettupalayam road and northern bounliar)’ of Forest College campus and runs towards soulh along the western side of Mettupalayam road upto southern end of Cowly Brown road., Thadagam Road, from Maruthamalai Main road North Side, To Ambethkar Road South Side."
          ],
          "south": [
            "Starts from Mettupalayam road and Cowly brown Road Junction runs towards west along the southernside of Cowly Brown road upto Agriculture University eastern side boundary and turns towards south along eastern side bour.dary and turns towards south along easternside Agriculture University side CoimbatoreCorporation57 CoimbatoreNorth10 boundary uptoSundapalayam road and turns towards west and runs along south side of Sundapalayam road upto eastern side boundary of the Narasampathi tank and runs towards west along Narasampathi tank boundary. from ThadagamRoad Junction To Tegalur Junction."
          ],
          "west": [
            "Starts from the western end of the Narasampathi Tank bund and runs towards north from south side Panaimarathur village across. Krishampathieri and eastern side of Kanuvaipallam crossing South Side from Ambethk3r Road To Agri To MaruthaMalai Road at door Number 24 and runstowards west along southern side of Maruthamalairoadupto Western. side· of Gogularn colony then runs."
          ]
        }
      },
      {
        "ward_number": "75",
        "ward_name": "Ward 75",
        "directions": {
          "north": [
            "Starting from East side of Happy Garden and runs towards Westenside of Nalvar Nagar."
          ],
          "east": [
            "Starting from Marudhamalai Main Road and PerumalKoil Street junction and run towards North side upto Happy Garden."
          ],
          "south": [
            "Starting from West side of Kalveerampalayam junction and Runs towards East side and ends at PerumalKoil Street junction (Mouthi Hospital Road)."
          ],
          "west": [
            "Starting at Nalvar N13gar and runs towards South side of Thondamuthur road and ends at Kalveerampalayam"
          ]
        }
      },
      {
        "ward_number": "78",
        "ward_name": "Ward 78",
        "directions": {
          "north": [
            "Starting from Ramaamoorthy road towards northen side north housing unit, towards east side chandrasekarapuram, rajarathinam garden upto selvachindhamani tank."
          ],
          "east": [
            "Starting from Ramaamoorthy road towards northen side north housing unit, towards east side chandrasekarapuram, rajarathinam garden upto selvachindhamani tank."
          ],
          "south": [
            "Starting from Kamarajar nagar via perur main road upto Rangappa layout."
          ],
          "west": [
            "Starting from Rangappa layout towards east, amul nagar, indra nagar, Aranganayagam layout, NSK street via upto Ramamoorthy road."
          ]
        }
      },
      {
        "ward_number": "79",
        "ward_name": "Ward 79",
        "directions": {
          "north": [
            "Starting from LIC colony perur main road junction towards east( south side) upto Perur main road sundakamuthur road junction."
          ],
          "east": [
            "Starting from perur main road, sundakan uthur road junction towards south corporation road via upto sethuma vaikkal."
          ],
          "south": [
            "Starting from sethuma vaikkal via towards Vl•st upto LIC colony."
          ],
          "west": [
            "Starting from LIC colony Raja vaikkal towards north upto perur road junction."
          ]
        }
      },
      {
        "ward_number": "80",
        "ward_name": "Ward 80",
        "directions": {
          "north": [
            "Starting from Krishnan Street South side first road via West side, Channel West side towards Kempetty Colony West side towards South side Govardhana Industry via West side upto Byepass Road South side."
          ],
          "east": [
            "Oppanakara Street (West) Vysial Veedhi Junction to Podhanur Road West Side upto Periyakulam"
          ],
          "south": [
            "Starting from Periyakulam bund and Sundakkamuthur Byepass Road Kempetty Colony Junction towards North upto Pattakkara Ayyasamy Raod Junction then to West upto Natti Street Junction."
          ],
          "west": [
            "Starting from West side of Sundakkamuthur road towards North from Selvachinthamani Kulam Road Swami Iyer new street and Krishna Street Junction."
          ]
        }
      },
      {
        "ward_number": "81",
        "ward_name": "Ward 81",
        "directions": {
          "north": [
            "Starting from Sukrawarpet Road Thiyagi Kumaran Street Junction to East upto Rangai Gounder Street Junction"
          ],
          "east": [
            "Starting from Sukrawarpet Road Rangai Gounder Street Junction to South upto Krishna Street Junction then to East upto Oppanakkara Street then via Raja Street upto Vysial Street Junction"
          ],
          "south": [
            "Starting from Sundakkamuthur Byepass Road Ukkadam Signal to West upto Kempetty Colony Junction then to North upto Pattakkara Ayyasamy Junction then to West via Kempetty Colony 7th Street upto Natti Street then Oppanakkara Street Vysial Street Junction towards West via Southern side of Subri Street therl towards Raja Veedi Oppankkara Veedi Junction to Karuppaiya Street"
          ],
          "west": [
            "Starting from Sundakkamuthur Byepass Road and Kempetty Colony Junction to North via Nadar Street Vairom Street Vysial Street Subri Street Raja Street Karuppaiya Street Junction to Krishnan Street upto Sukrawarpet Road"
          ]
        }
      },
      {
        "ward_number": "82",
        "ward_name": "Ward 82",
        "directions": {
          "north": [
            "Starting from Rangai Gounder Street Sukrawarpet Junction to East upto Railway Track"
          ],
          "east": [
            "Starting from Railway Track near Avinashi Road Flyover to towards South upto Ukkadam Byepass Road Bridge"
          ],
          "south": [
            "Starting from Ukkadam Byepass Road Rialway Track to West upto Church then to West Podhanur Road Junction"
          ],
          "west": [
            "Starting from Pddhanur Road Ukkadam Byepass Road Junction to North upto Oppanakkara Street Big Bazaar Street Junction then RG Street Krishnan Street Junction to North uptd Sukrawarpet Road Junction."
          ]
        }
      },
      {
        "ward_number": "83",
        "ward_name": "Ward 83",
        "directions": {
          "north": [
            "Starting from Railway Track towards East Chellappan Street via North Side S.Jeyam Bunk then towards South T.Kunki Raman General Merchant then towards East Park Street via North Side till Tyre Company then towards South West side of Dr.Nanjappa Road crossed then via North side of VOC Park Road towards East upto Balasundaram Road RTO Office"
          ],
          "east": [
            "Starting from RTO Office South Western side of Balasundaram Road towards Avinashi Road to East upto Avinashi Road Nava India Junction"
          ],
          "south": [
            "Starting from Balasundaram Road Avinashi Road Junction towards West North side of Avinashi ‘Road SF No.997 turn to South Ummayama Nagar Street No.2 via down side till SF No.74 then towards West Kadalakkara Street No.2 till railway line and to South upto Trichy Road Lanka corner railway line"
          ],
          "west": [
            "Starting from Trichy Road Sungam Junction to Lanka corner North side of the road."
          ]
        }
      },
      {
        "ward_number": "84",
        "ward_name": "Ward 84",
        "directions": {
          "north": [
            "Starting from Valankulam Road Shivaram Nagar Road Junction to West upto Sungam Byepass Road GM Nagar Junction"
          ],
          "east": [
            "Starting from Valankulam to South via Shivaram Nagar Road upto Railway track"
          ],
          "south": [
            "Starting from SF No.1077 Junction to Coimbatore to Podhanur Railway Line"
          ],
          "west": [
            "Starting from Sungam Byepass Road GM. Nagar Junction to South upto Saramedu Main road"
          ]
        }
      },
      {
        "ward_number": "85",
        "ward_name": "Ward 85",
        "directions": {
          "north": [
            "Starting from pollachi road and then east side of kurichi tank then towards to south side vengadachalapathinagar, alagunagar, mmpnagar, bharathinagar, uptosabarinagar and then towards northern side odpothanur road, chathiramst via ammannagar, nanjundapuarm (Village boundary) and then towards eastern 6ide arputhamnagarupto village boundary of vellalore."
          ],
          "east": [
            "Starting from southern side village boundary of vellalore upto Coimbatore Corporation sewage form"
          ],
          "south": [
            "Starting from Coimbatore Corporation sewage form towards western side upto Padmalaya layout compound wall and then north side vellalore road acrossing the western side upto chettipalayam-vellalore road junction and then western side of Railway Flyover via Railway kalyanamandapam, sarada mill road, policequarters, MGRNagar, bharathinagar, gandhijiroad, upto Kuniamuthur village boundary."
          ],
          "west": [
            "Starting from Eastern side of kuruchi tank wall towards Vengadactialapathi nagar layouts and upto Gandhiji road."
          ]
        }
      },
      {
        "ward_number": "86",
        "ward_name": "Ward 86",
        "directions": {
          "north": [
            "Starting from Ukkadam – Sungam bypass road towards eastern side upto Coimbatore Corporation sewage form."
          ],
          "east": [
            "Starting from Coimbatore Corporation sewage form towards southern side, Anbunagar, Karumbukadai upto athupalam."
          ],
          "south": [
            "Starting from athupalam towards western side via Asath nagar upto Periyakulam."
          ],
          "west": [
            "Starting from Periyakulam boundary towards northern side, boundary of ukkadam tank upto ukkadam bus stand."
          ]
        }
      },
      {
        "ward_number": "87",
        "ward_name": "Ward 87",
        "directions": {
          "north": [
            "Starting from kuniyamuthur village boundary (kuruchi govt higher secoundary school towards estern side kuruchi tank bund, poonga nagar, GK square via pollachi road upto china kulam."
          ],
          "east": [
            "Starting from Palakkad Road Easter side Sadam Nagar to Machampalayam Road Junction Nalavaratha konar Street."
          ],
          "south": [
            "Starting from jaya nagar kuruchi village boundary towards western side machampalayam road junction and western side of subbulakshmi nagar first steel via palakad road annamanayakar street junction and palakad road western side sundakkamuthur road, northern side NS bakery mariyamman kovil street via china sudukadu road, brindhavan circle towards south amman kovil road upto northern side of karupanna kovil thottam."
          ],
          "west": [
            "Starting from Amrnan Kovil Karuppannan Gounder Thottam North Side to Puttuviki Road Easter side Vaiyapuri pudur."
          ]
        }
      },
      {
        "ward_number": "88",
        "ward_name": "Ward 88",
        "directions": {
          "north": [
            "Starting from Amman Kovil Street towards South Karuppanna Gounder Thottam Norther Side to Palakkadu Road Junction."
          ],
          "east": [
            "Starting from Palakkad Road Souther Side to Sundakkamuthur Road Junction to Senkulam Road."
          ],
          "south": [
            "Starting from Palakkad Road Western Side via Senkulam Road to Venkitasamy Thottam."
          ],
          "west": [
            "Starting from Senkulam Western Side Venkitasamy Thottam to Amman Kovil Road."
          ]
        }
      },
      {
        "ward_number": "89",
        "ward_name": "Ward 89",
        "directions": {
          "north": [
            "Starting from Ramachettipalayam burial ground to amman kovil road norther side."
          ],
          "east": [
            "Starting from Amman Kovil Road towards South to Press Enclave Boundry."
          ],
          "south": [
            "Starting from Press Enclave to Village Road Boundry."
          ],
          "west": [
            "Starting from Village Road towards North to Ramachettipalayam Burial Ground."
          ]
        }
      },
      {
        "ward_number": "90",
        "ward_name": "Ward 90",
        "directions": {
          "north": [
            "Starting from Sundakkamuthur – perur Road Sundakamuthur Asramam School towards East to Thottarayan Kovil Junction."
          ],
          "east": [
            "Starting from Thottarayan Kovil Junction to Arivoli Nagar, MGR Nagar Road Junction."
          ],
          "south": [
            "Starting from Arivoli Nagar – MGR Nagar Junction to Village Boundry Wester Side."
          ],
          "west": [
            "Starting from Village Boundry Wester Side to Sundakkamuthur- Perur Road junction."
          ]
        }
      },
      {
        "ward_number": "91",
        "ward_name": "Ward 91",
        "directions": {
          "north": [
            "Starting from Venkatesh Thottan towards Palakkad Main Road Wester Side to Senkulam Road Junction."
          ],
          "east": [
            "Starting from Palakad Main Road Western Side Senkulam Junction to Manjipallam Northern to Side."
          ],
          "south": [
            "Starting from Palakad Main Road Wester Side Manjipallam Northern Side to Arivoli Nagar – MGR Nagar junction."
          ],
          "west": [
            "Starting from Arivoli Nagar – MGR Nagar Road Junction to Vekatesh Thottam."
          ]
        }
      },
      {
        "ward_number": "92",
        "ward_name": "Ward 92",
        "directions": {
          "north": [
            "Starting from Palakkad Main Road Easter Side via Padasalai Street to B.K.Pudur Madurai Veeran Kovil Street Junction."
          ],
          "east": [
            "Starting from B.K.Pudur MaduraiVeeran Kovil Street Metukadu Road Junction To Senthamil Na’gar Village Boundry Junction Side."
          ],
          "south": [
            "Starting from Sentamil Nagar Hills Village Boundry Junction Side to Manjipallam North Side Palakkad Main Road Junction."
          ],
          "west": [
            "St rting from Palakkad Main Road Easter side Manjipallam Junction to towards North Side Krishna Nagar Road to Padasalai Road Junction."
          ]
        }
      },
      {
        "ward_number": "93",
        "ward_name": "Ward 93",
        "directions": {
          "north": [
            "Starting from Palakkad Main Road Easter side Annama Naiker street South Side , Jaya Nagar northen side upto kuruchi kulam."
          ],
          "east": [
            "Starting from Jaya Nagar Road northen side upto kuruchi kulam to B.K.Pudur Maduraiveeran Kovil Street upto Medukadu Junction."
          ],
          "south": [
            "Starting from B.K.Pudur Maduraiveeran Kovil Street Medukadu Junction to Palakkadu Main Road Junction."
          ],
          "west": [
            "Starting from Palakkad Main Road southern side of Burial Ground towards northern side kvmaran garden, blalaji nagar, edayar palayam salai, lakshmi nagar. Thirunavukarasu nagar, siruvani salai junction upto AnnamaNaiker Street."
          ]
        }
      },
      {
        "ward_number": "94",
        "ward_name": "Ward 94",
        "directions": {
          "north": [
            "Starting from kurichi tank and village boundary of kuniamuthur( Kurichi govt. school), toward east side of kurichi tank bund nrae by poonganagar,via GK Square to pollachi road uptochinnakulam."
          ],
          "east": [
            "Starting from Pollachi road chinnakulam (southern side of CMG Elementary school)via pollachi road western side towards south side of pollachi road upto SB Tower Door No 264, 265, 265 A and then towards southern side of madukarai market road and then western side saravannagar, ashoknagar, uzhavarsandhai, kasturinagar, annai Indira nagaruptovinayagar temple."
          ],
          "south": [
            "Starting from Madukarai market road annai Indira nagarvinayagar temple towards western side of pathivalarcolony, arul garden compound wall, karuveppilaithottam upto Machampalayam sudukadu."
          ],
          "west": [
            "Starting from Macharttpalayam sudukadu towards north sideof idarpalayamand then towards northern side of siruvani road acrossing via kurichi village boundary to MKN Nagar, Nilgris avenue upto Kurichi govt School."
          ]
        }
      },
      {
        "ward_number": "95",
        "ward_name": "Ward 95",
        "directions": {
          "north": [
            "Starting from Satham nagar towards Aathupalam estern side towards Noyyal River upto kathiravan nagar, uthayam nagar."
          ],
          "east": [
            "Starting from Noyyal River uthayam nagar southern side towards kathiravan nagar upto kovai to podanur road school."
          ],
          "south": [
            "Starting from Pothanur highways Road western side towards loyets avenue, ummar nagar, thiruvalluvar nagar, bharathi nagar upto thirumarai nagar and pollachi road."
          ],
          "west": [
            "Starting from Thirumarai nagar and Coimbatore Pollachi National Highways Road upto athupalam."
          ]
        }
      },
      {
        "ward_number": "96",
        "ward_name": "Ward 96",
        "directions": {
          "north": [
            "Starting from pollachi gandhiji road junction towards eastern side loganathapuram via gandhijiroad,thayammal layout up to Gurusamipillaist."
          ],
          "east": [
            "Starting from Gurusamipillai st southern side upto Sarada mill road."
          ],
          "south": [
            "Startingfromsarada mill road police quarters compound, Arumugampillaist, Gurusamipillaist, LIC Colony towards western side upto Pollachi road via 100 feet road TNHB Phase-1 road to Madukarai market road."
          ],
          "west": [
            "Starting from madukarai road TNHB Phase -1 towards northern side arignarannacolony, palaniyappa lay out, annanagar, upto Pollachi road Gandhiji road junction."
          ]
        }
      },
      {
        "ward_number": "97",
        "ward_name": "Ward 97",
        "directions": {
          "north": [
            "Starting from mgr nagar ext to kurinjinagar sathyamurthinagar kamarajnagar viamadukarai market road up to TNHB Phase 1."
          ],
          "east": [
            "Starting from madukarai market road TNHB Phase 1 towards south side TNHB Phase 2, kovai to palakad railway track via pollachi road western side of eachanari and upto eacher company."
          ],
          "south": [
            "Starting from eacher company western side of village boundary of sirapalayam, vaikal and towards western side of madukarai market road upto MM eng company."
          ],
          "west": [
            "Starting from MM eng company, madukarai ma ket road Coimbatore to Palakadu Railway track towards northern side via vaikal,pillayarpuram crossing the kallukuliroad; nagarajapuram, ganthinagar, bisminagar, village boundary of kuniamuthur and then towards north side CTO colony, gopalapuram, MGR nagar ext."
          ]
        }
      },
      {
        "ward_number": "98",
        "ward_name": "Ward 98",
        "directions": {
          "north": [
            "Starting from sarada mill road-muthumariamman kovil junction towards east side arputham chettiyar st, ramanuja naidu st, sami nagar, Arumugam pillai st via sarada mill road upto Ismail st."
          ],
          "east": [
            "Starting from Ismail Street junction towards southern side panchayat office st, ammaunavagam, policeline, Covai-palakadu railway tracks uptopollachiroad, muthunagar."
          ],
          "south": [
            "Starting from pollachiroad, towards western side upto private industrial area scheme no 5."
          ],
          "west": [
            "Starting from upto private industrial area scheme no 5, sidco towards north 100 feet road and then eastern side pollachi road and then towards uptosarada mill road-muthumariammankovil junction."
          ]
        }
      },
      {
        "ward_number": "99",
        "ward_name": "Ward 99",
        "directions": {
          "north": [
            "Starting from sarada mill road masthansaibust junction towards east church road, railway flyover and then towards western side upto GD violar Company compound wall."
          ],
          "east": [
            "Starting from GD violar Company compound wall, padmalaya, Corporation sewage fonTJ west compound wall"
          ],
          "south": [
            "Starting from Corporation sewage west side towards western side chettipalayam road junction, Aspestasst kovai to palakad railway track upto masthansaibu street."
          ],
          "west": [
            "Starting from Masthan Saibu street to church street."
          ]
        }
      },
      {
        "ward_number": "100",
        "ward_name": "Ward 100",
        "directions": {
          "north": [
            "Starting from Aspestash street towards east chettipalayam road, Eachanari- chettipalayam road junction"
          ],
          "east": [
            "Starting from Eachanari-chettipalayam road junction towards southern side the kuruchi village boundary upto pollachi road."
          ],
          "south": [
            "Starting from pollachi road and Eachanari-chettipalayam road junction."
          ],
          "west": [
            "Starting from pollachi road towards northern side kovai palakad railway track . kovai to pollachi railway track upto Aspestas company."
          ]
        }
      }
    ]
  }
}